In [1]:
import pandas as pd

data=pd.read_excel("Student.xlsx")

In [4]:
data

   Unnamed: 0      name  age state semester
0           0  Suryansh   20    MP      3rd
1           1    Ganesh   24    MP      6th
2           2    Aakash   26    MP  Passout
3           3    Vakhya   24    MP      7th

In [3]:
data["Unnamed: 0"]

0    0
1    1
2    2
3    3
Name: Unnamed: 0, dtype: int64

In [5]:
data.drop(columns=["Unnamed: 0"])

       name  age state semester
0  Suryansh   20    MP      3rd
1    Ganesh   24    MP      6th
2    Aakash   26    MP  Passout
3    Vakhya   24    MP      7th

In [6]:
data = data.drop(columns=["Unnamed: 0"])

In [7]:
data

       name  age state semester
0  Suryansh   20    MP      3rd
1    Ganesh   24    MP      6th
2    Aakash   26    MP  Passout
3    Vakhya   24    MP      7th

In [8]:
data[ data["name"]=="Ganesh" ] # select * from data where name = "Ganesh"

     name  age state semester
1  Ganesh   24    MP      6th

In [9]:
data[ data["name"] != "Ganesh" ] # select * from data where name != "Ganesh"

       name  age state semester
0  Suryansh   20    MP      3rd
2    Aakash   26    MP  Passout
3    Vakhya   24    MP      7th

In [10]:
data[ data["age"] > 21 ] # select * from data where age > 21

     name  age state semester
1  Ganesh   24    MP      6th
2  Aakash   26    MP  Passout
3  Vakhya   24    MP      7th

In [11]:
data[ data["age"] > data["age"].mean() ] # select * from data where age > avg(age)

     name  age state semester
1  Ganesh   24    MP      6th
2  Aakash   26    MP  Passout
3  Vakhya   24    MP      7th

In [13]:
data["age"].sort_values()

0    20
1    24
3    24
2    26
Name: age, dtype: int64

In [14]:
data["age"].sort_values()[0]

np.int64(20)

In [15]:
data[ data["age"].sort_values()[0] ]

KeyError: np.int64(20)